#四则运算：‘+’、‘-’、‘*’、‘/’
#取整：//  向下取整
#取余：%   b%c=b-c*(b//c)
#乘方：**
#二进制、八进制、十六进制都是以0开头的
#变量必须赋值后使用，没有默认值
#可使用变量引用函数
#在交互式解释器中，语句和表达式没有区别
#round函数：整数总是向下圆整，而round圆整到最接近的整数，并在两个整数一样近时圆整到偶数。
#int类：转换成整型  str类：转换成字符串 repr函数：将值转换成字符串
#input函数：打印提示信息，要求用户输入
#print函数：打印信息
#abs函数：取绝对值
#用import命令导入模块，用.方式使用模块中的函数
#如果确定不会从别的模块导入别的同名函数，可以用import的变种from 模块名 import 函数名
#math模块：floor向下圆整，ceil返回大于或等于给定数的最小整数，sqrt计算平方根
#cmath模块：sqrt计算平方根
#__future__模块:时光机
#turtle模块：forward向前、left向左、back向后、right向右、penup抬起铅笔、pendown放下铅笔
#字符串：主要用途表示一段文本
#字符串和数一样，都是值
#转义：\
#字符串拼接：+
#长字符串：用三引号括起来（可跨越多行），常规引号跨越多行要在结尾加上\，原始字符串以r为前缀包含\不转义(除引号外，对引号转义后打印保留\)
